insert into clothing_type (clothing_type_id, type_name) values 
("1", "เสื้อ"),
("2", "เสื้อคลุม"),
("3", "กางเกง"),
("4", "กระโปรง");

insert into lucky_color_type (lucky_color_type_id, lucky_color_type_name) values
("1", "กาลกิณี"),
("2", "การงาน"),
("3", "ความรัก"),
("4", "โชคลาภ"),
("5", "ทรัพย์"),
("6", "บริวาร"),
("7", "การเรียน"),
("8", "สุขภาพ"),
("9", "เสน่ห์"),
("10", "อำนาจ"),
("11", "โชคดี");

INSERT INTO color_theory (color_theory_id, color_theory_name, description) VALUES
(1, 'Complementary', 'การจับคู่สีที่อยู่ตรงข้ามกันบนวงล้อสี เพื่อให้ลุคโดดเด่นและมีคอนทราสต์'),
(2, 'Analogous', 'การจับคู่สีที่อยู่ใกล้กันบนวงล้อสี เพื่อให้ลุคดูกลมกลืนและสบายตา'),
(3, 'Triadic', 'การจับคู่สามสีที่มีระยะห่างเท่ากันบนวงล้อสี เพื่อให้ลุคดูสมดุลและมีชีวิตชีวา');

insert into color_category (color_category_id, color_category_hex, color_category_name) values
  (1,  '#FF0000', 'แดง'),
  (2,  '#DC143C', 'แดงเข้ม'),
  (3,  '#FFC0CB', 'ชมพู'),
  (4,  '#FF1493', 'ชมพูเข้ม'),
  (5,  '#FF69B4', 'ชมพูสด'),
  (6,  '#FF4500', 'ส้มแดง'),
  (7,  '#FF6347', 'ส้มอ่อน'),
  (8,  '#FFA500', 'ส้ม'),
  (9,  '#FFFF00', 'เหลือง'),
  (10, '#FFD700', 'ทอง'),
  (11, '#F0E68C', 'กากี'),
  (12, '#FF00FF', 'บานเย็น'),
  (13, '#800080', 'ม่วง'),
  (14, '#4B0082', 'คราม'),
  (15, '#008000', 'เขียว'),
  (16, '#006400', 'เขียวเข้ม'),
  (17, '#008080', 'เขียวขี้ม้า'),
  (18, '#808000', 'มะกอก'),
  (19, '#00FFFF', 'ฟ้าอมเขียว'),
  (20, '#0000FF', 'น้ำเงิน'),
  (21, '#000080', 'น้ำเงินเข้ม'),
  (22, '#A52A2A', 'น้ำตาล'),
  (23, '#800000', 'เลือดหมู'),
  (24, '#DAA520', 'ทองเหลือง'),
  (25, '#D2B48C', 'แทน'),
  (26, '#FFFFFF', 'ขาว'),
  (27, '#F5F5DC', 'เบจ'),
  (28, '#FFE4E1', 'ชมพูอ่อน'),
  (29, '#0FFFFF', 'ฟ้าอ่อน'),
  (30, '#000000', 'ดำ'),
  (31, '#C0C0C0', 'เงิน'),
  (32, '#808080', 'เทา'),
  (33, '#FF4F00', 'ส้มสด'),
  (34, '#654321', 'น้ำตาลเข้ม'),
  (35, '#FFBA00', 'เหลืองสด'),
  (36, '#006D6F', 'เขียวหัวเป็ด'),
  (37, '#003262', 'น้ำเงินกรมท่า'),
  (38, '#301934', 'ม่วงดำ'),
  (39, '#636363', 'เทาเข้ม'),
  (40, '#702963', 'ม่วงพลัม'),
  (41, '#8B008B', 'ม่วงเข้ม'),
  (42, '#83068', 'ม่วงหม่น'),
  (43, '#F0F8FF', 'ฟ้าจาง'),
  (44, '#FEFEFA', 'ขาวนวล'),
  (45, '#FFF8E7', 'ครีม'),
  (46, '#F8F8F8', 'ขาวอมเทา'),
  (47, '#CDE7CA', 'เขียวชา');
  







